{
  "id": "home-assistant-matter",
  "title": "Home Assistant + Matter",
  "emoji": "🏠",
  "summary": "Unify every smart device under one open-source hub. No more 12 different apps.",
  "content": "<p>Home Assistant has become the gold standard for smart home control, and with Matter support built in, it's now easier than ever to bring every device under one roof. Whether you're running Hue lights, Ecobee thermostats, or Eve sensors, Matter gives them a common language — and Home Assistant speaks it fluently.</p><p>The real magic is in automations. Set your lights to dim at sunset, lock the doors when everyone leaves, and get notified if a water sensor triggers — all from a single dashboard. No cloud dependency, no subscriptions, and your data stays local.</p><p>Setup takes about an hour with a Raspberry Pi or a mini PC. Once running, you'll wonder how you ever managed a smart home without it. The community adds integrations weekly, covering everything from robot vacuums to EV chargers.</p>",
  "tags": [
    "Smart Home",
    "Automation"
  ],
  "section": "tech",
  "featured": false,
  "guides": [
    {
      "title": "Easy: Home Assistant Green",
      "difficulty": "beginner",
      "timeEstimate": "20 min",
      "steps": [
        {
          "text": "Buy Home Assistant Green (plug-and-play hub)",
          "link": "https://www.home-assistant.io/green/"
        },
        {
          "text": "Connect it to your router with the included Ethernet cable"
        },
        {
          "text": "Open homeassistant.local:8123 in your browser and create your account"
        },
        {
          "text": "Go to Settings → Devices → Add Integration → Matter"
        },
        {
          "text": "Put your Matter device in pairing mode and scan the QR code"
        },
        {
          "text": "Set up your first automation (e.g., lights off at bedtime)"
        }
      ],
      "video": "https://youtube.com/watch?v=MnRAft6pNqs"
    },
    {
      "title": "DIY: Raspberry Pi Setup",
      "difficulty": "intermediate",
      "timeEstimate": "45 min",
      "steps": [
        {
          "text": "Download the HA OS image for Raspberry Pi 4/5",
          "link": "https://www.home-assistant.io/installation/raspberrypi"
        },
        {
          "text": "Flash the image to an SD card using Balena Etcher",
          "link": "https://etcher.balena.io/"
        },
        {
          "text": "Insert the SD card, connect Ethernet, and power on the Pi"
        },
        {
          "text": "Wait 5-10 minutes for first boot, then open homeassistant.local:8123"
        },
        {
          "text": "Create your account and walk through the onboarding wizard"
        },
        {
          "text": "Install the Matter Server add-on from Settings → Add-ons"
        },
        {
          "text": "Add a Thread/Matter-compatible USB radio if needed (SkyConnect)",
          "link": "https://www.home-assistant.io/skyconnect/"
        },
        {
          "text": "Pair your first Matter device and build automations"
        }
      ]
    }
  ]
}
