{
  "id": "home-assistant-matter",
  "title": "Home Assistant + Matter",
  "emoji": "🏠",
  "summary": "The open-source smart home hub that finally makes all your devices work together. With Matter support, brand lock-in is dead.",
  "content": "<p>Home Assistant is the open-source brain of a truly smart home. It runs locally on your network, connects to over 2,000 integrations, and gives you a single dashboard for everything — lights, thermostats, cameras, locks, sensors, and more. No cloud required, no subscription fees.</p><p>The addition of Matter support is a game-changer. Matter is a universal smart home protocol backed by Apple, Google, Amazon, and Samsung. Devices that support Matter work across all platforms automatically. Home Assistant's Matter integration means you can buy any Matter-certified device and it just works — no more checking compatibility lists.</p><p>The automation engine is where Home Assistant really shines. Set up rules like \"turn off all lights when everyone leaves\" or \"start the robot vacuum when nobody's home\" using a visual editor or YAML. Combine it with voice assistants, presence detection, and energy monitoring for a home that truly runs itself.</p>",
  "tags": [
    "Smart Home",
    "Automation"
  ],
  "section": "tech",
  "guides": [
    {
      "title": "Matter + Home Assistant Quick Start Guide",
      "type": "video",
      "source": "TechteamGB",
      "url": "https://www.youtube.com/watch?v=1iBHRvL8jiY",
      "summary": "Quick start walkthrough for setting up Matter devices with Home Assistant."
    },
    {
      "title": "Official Getting Started Guide",
      "type": "article",
      "source": "Home Assistant",
      "url": "https://www.home-assistant.io/getting-started/",
      "summary": "Step-by-step installation instructions for all supported platforms."
    },
    {
      "title": "Quick Overview",
      "type": "summary",
      "steps": [
        "Get hardware (Raspberry Pi, mini PC, or Home Assistant Green)",
        "Install Home Assistant OS from the official image",
        "Connect devices via integrations (Wi-Fi, Zigbee, Matter)",
        "Build automations using the visual editor",
        "Set up dashboards and remote access"
      ]
    }
  ]
}