{
  "id": "shortcuts-nfc-tags",
  "title": "Shortcuts + NFC Tags",
  "emoji": "📱",
  "summary": "Tap your phone to a $0.50 sticker to trigger any automation. Start timers, control lights, log habits.",
  "content": "<p>NFC tags cost pennies, stick anywhere, and turn your phone into a magic wand. Pair them with Apple Shortcuts or Android's Tasker and you can trigger complex automations with a single tap — no app opening required.</p><p>Stick one on your nightstand to activate your bedtime routine: lights off, alarm set, Do Not Disturb on. Put another by the front door to log when you leave and turn off all smart devices. The possibilities are endless and the setup takes minutes per tag.</p><p>Power users chain multiple actions together — tap a tag at your desk to start a Pomodoro timer, open your task manager, and set Slack to DND. At roughly $0.30-0.50 per tag in bulk, this is the cheapest productivity upgrade you'll ever make.</p>",
  "tags": [
    "Automation",
    "Smart Home"
  ],
  "section": "tech",
  "featured": false,
  "guides": [
    {
      "title": "iPhone Setup with Shortcuts",
      "difficulty": "beginner",
      "timeEstimate": "15 min",
      "steps": [
        {
          "text": "Buy NFC tags (NTAG215 recommended, ~/bin/bash.50 each)",
          "link": "https://www.amazon.com/dp/B0727NYX3B"
        },
        {
          "text": "Open the Shortcuts app on your iPhone"
        },
        {
          "text": "Tap Automation → + → NFC"
        },
        {
          "text": "Scan your blank NFC tag to register it"
        },
        {
          "text": "Build your automation (e.g., set lights, start timer, toggle DND)"
        },
        {
          "text": "Stick the tag where you want it (nightstand, desk, door frame)"
        },
        {
          "text": "Tap your phone to the tag to test — done!"
        }
      ]
    },
    {
      "title": "Android Setup with NFC Tools",
      "difficulty": "beginner",
      "timeEstimate": "15 min",
      "steps": [
        {
          "text": "Buy NFC tags (NTAG215 recommended)",
          "link": "https://www.amazon.com/dp/B0727NYX3B"
        },
        {
          "text": "Install NFC Tools from the Play Store",
          "link": "https://play.google.com/store/apps/details?id=com.wakdev.wdnfc"
        },
        {
          "text": "Open NFC Tools → Write → Add a record"
        },
        {
          "text": "Choose your action type (URL, text, or custom task)"
        },
        {
          "text": "For advanced automations, install Tasker and Trigger plugin",
          "link": "https://play.google.com/store/apps/details?id=net.dinglisch.android.taskerm"
        },
        {
          "text": "Write the automation to your NFC tag"
        },
        {
          "text": "Place the tag and test by tapping your phone to it"
        }
      ]
    }
  ]
}
