{
  "id": "shortcuts-nfc-tags",
  "title": "Shortcuts + NFC Tags",
  "emoji": "📱",
  "summary": "Tap your phone on a $0.50 NFC tag to trigger complex automations. Start your morning routine, log workouts, or control your smart home with a single tap.",
  "content": "<p>NFC tags are tiny, cheap stickers that trigger Apple Shortcuts (or Android automations) when you tap your phone on them. Stick one on your nightstand to start your morning routine, one on your desk to toggle focus mode, or one by the door to arm your security system.</p><p>The power comes from combining NFC triggers with Shortcuts automations. A single tap can: turn off all lights, set the thermostat, start a playlist, send a goodnight text, and set your alarm. Or tap when you arrive at the gym to start a workout timer, toggle Do Not Disturb, and open your exercise app.</p><p>NFC tags cost pennies — you can get a 30-pack for under $15. They need no battery, last forever, and work through stickers, keychains, and even embedded in furniture. Combined with Home Assistant or HomeKit, they become the simplest smart home interface possible: just tap.</p>",
  "tags": [
    "Automation",
    "Smart Home"
  ],
  "section": "tech",
  "guides": [
    {
      "title": "NFC Tags + iPhone Can Automate Anything!",
      "type": "video",
      "source": "Stephen Robles",
      "url": "https://www.youtube.com/watch?v=_Xx8d_DV4Ew",
      "summary": "Shows how to pair NFC tags with iPhone Shortcuts for powerful home automations."
    },
    {
      "title": "Apple Shortcuts User Guide",
      "type": "article",
      "source": "Apple",
      "url": "https://support.apple.com/guide/shortcuts/intro-to-personal-automation-apd690170742/ios",
      "summary": "Official Apple guide covering NFC triggers, automation setup, and Shortcuts basics."
    },
    {
      "title": "Quick Overview",
      "type": "summary",
      "steps": [
        "Buy NFC tags (NTAG215, ~$0.50 each)",
        "Open Shortcuts → Automation → New → NFC",
        "Scan the tag to register it",
        "Build your automation actions (lights, scenes, apps, messages)",
        "Stick the tag where you'll tap it daily"
      ]
    }
  ],
  "hub": "smart-home",
  "simplicityScore": {
    "timeSaved": 6,
    "setupEffort": 3,
    "score": 6.3
  },
  "frictionNote": "iPhone-centric. Android support is clunkier. Tags need precise phone placement to scan.",
  "dropId": null
}