{
  "id": "shortcuts-nfc-tags",
  "title": "Shortcuts + NFC Tags",
  "emoji": "📱",
  "summary": "Tap your phone on a $0.50 NFC tag to trigger complex automations. Start your morning routine, log workouts, or control your smart home with a single tap.",
  "url": "https://support.apple.com/guide/shortcuts/intro-to-personal-automation-apd690170742/ios",
  "editorsNote": "Reddit's r/shortcuts notes that NFC automations on iPhone still require a confirmation tap before running (Apple's security restriction), which undermines the 'single tap' promise — you actually tap the tag, then tap 'Run' on the notification. Android via Tasker/MacroDroid runs NFC triggers without confirmation. Most iPhone users say the slight friction is worth it for complex multi-step automations.",
  "content": "<h3>How to automate your daily routines with a single tap</h3><p>Every morning you do the same sequence: turn on the lights, check the weather, start a playlist, adjust the thermostat, and open your task manager. Every night: turn off the lights, set the alarm, enable Do Not Disturb, lock the door. Each action takes 10-15 seconds and requires opening a different app. That's 5-8 minutes daily spent on repetitive sequences you've done a thousand times. Smart speakers help, but voice commands are awkward when someone's sleeping, unreliable in noisy environments, and limited to one action at a time. You need a physical trigger that fires a complex sequence instantly.</p><p>NFC (Near Field Communication) tags are passive stickers the size of a coin that cost $0.30-0.50 each. When you tap your phone on one, it triggers an automation built in Apple Shortcuts (iOS) or Tasker/MacroDroid (Android). A single tap on a tag stuck to your nightstand can: turn off all lights, lock the front door, set the thermostat to sleep mode, enable Do Not Disturb, set your alarm, and start a sleep sounds playlist — all in under 2 seconds. No app to open, no voice command to speak, no buttons to press. The tags need no battery, never wear out, and work through stickers, keychains, and even embedded in furniture.</p><p>The standout features are the unlimited customization (each tag triggers a different Shortcuts automation — you can have 20 tags around your home each doing something unique), the zero cost for the trigger mechanism ($15 for a 30-pack of tags), and the integration depth with <a href=\"article.html?id=home-assistant-matter\">Home Assistant</a> and HomeKit. A tag by your front door can arm the security system, turn off all lights, and send your partner a \"leaving now\" text. A tag at your gym locker can start a workout timer, toggle Do Not Disturb, and open your exercise app. A tag on your desk can toggle focus mode, start a Pomodoro timer, and open your project management tool.</p><p>The real-world impact is eliminating 5-8 minutes of daily routine friction — that's 30-50 hours per year. More importantly, it reduces the cognitive overhead of \"what do I need to do right now?\" into a single physical action. Users report that the physical tap creates a satisfying ritual that reinforces habits better than voice commands or app widgets. The total investment is under $15 for tags and 30 minutes to set up your automations. Compared to a $200 smart speaker that does one thing at a time with voice commands, NFC tags are faster, more reliable, work silently, and cost 1% as much. Combined with the <a href=\"article.html?id=ecobee-smart-thermostat\">Ecobee thermostat</a> and smart lights, they become the simplest smart home interface possible.</p><h3>⚡ Set it up in 5 minutes</h3><ol><li>Buy NTAG215 NFC tags — a 30-pack on Amazon costs $10-15</li><li>Open Apple Shortcuts → Automation → New Automation → NFC, and scan a tag to register it</li><li>Build your automation sequence — add actions for lights, thermostat, messages, apps, music, etc.</li><li>Stick the tag where you'll use it: nightstand, desk, front door, gym bag, car dashboard</li><li>Tap your phone on the tag to trigger the full sequence</li></ol>",
  "tags": [
    "Automation",
    "Smart Home"
  ],
  "section": "tech",
  "guides": [
    {
      "title": "NFC Tags + iPhone Can Automate Anything!",
      "type": "video",
      "source": "Stephen Robles",
      "url": "https://www.youtube.com/watch?v=_Xx8d_DV4Ew",
      "summary": "Shows how to pair NFC tags with iPhone Shortcuts for powerful home automations."
    },
    {
      "title": "Apple Shortcuts User Guide",
      "type": "article",
      "source": "Apple",
      "url": "https://support.apple.com/guide/shortcuts/intro-to-personal-automation-apd690170742/ios",
      "summary": "Official Apple guide covering NFC triggers, automation setup, and Shortcuts basics."
    },
    {
      "title": "Quick Overview",
      "type": "summary",
      "steps": [
        "Buy NFC tags (NTAG215, ~$0.50 each)",
        "Open Shortcuts → Automation → New → NFC",
        "Scan the tag to register it",
        "Build your automation actions (lights, scenes, apps, messages)",
        "Stick the tag where you'll tap it daily"
      ]
    }
  ],
  "hub": "smart-home",
  "simplicityScore": {
    "score": 6.4,
    "timeSaved": 6,
    "easeOfSetup": 7
  },
  "frictionNote": "iPhone-centric. Android support is clunkier. Tags need precise phone placement to scan.",
  "dropId": null
}
