{
  "id": "tailscale",
  "title": "Tailscale",
  "emoji": "🔒",
  "summary": "A zero-config VPN that connects all your devices into a secure private network. Access your home server, NAS, or Raspberry Pi from anywhere.",
  "url": "https://tailscale.com/",
  "editorsNote": "Reddit's r/Tailscale and r/selfhosted note that while Tailscale is incredibly easy, the coordination server is proprietary and cloud-hosted — privacy-focused users prefer Headscale (self-hosted alternative) but lose the simplicity. The free tier's 3-user limit also frustrates families who want to share a network. Most agree it's the single best networking tool for non-experts.",
  "content": "<h3>How to access your home network from anywhere without a networking degree</h3><p>You set up a home server, a NAS, or a Raspberry Pi running Home Assistant. It works great on your local network. Then you leave the house and can't access any of it. The traditional solution is port forwarding: log into your router, configure NAT rules, set up dynamic DNS because your IP changes, and hope you didn't just expose your entire network to the internet. Most people give up at step one. Even those who succeed create security vulnerabilities that would make any sysadmin cringe. Remote access to your own devices shouldn't require a networking certification.</p><p>Tailscale is a mesh VPN built on WireGuard that makes all your devices accessible to each other, regardless of where they are. Install it on your laptop, phone, home server, and Raspberry Pi — they all get stable IP addresses in a private network that works everywhere. No port forwarding, no firewall rules, no dynamic DNS, no configuration files. Want to SSH into your home server from a coffee shop? Use its Tailscale IP. Want to access your <a href=\"article.html?id=home-assistant-matter\">Home Assistant</a> dashboard from your phone while traveling? It's already there. The magic is in the zero-config approach: devices authenticate through your existing identity provider (Google, Microsoft, GitHub) and the mesh network forms automatically.</p><p>The standout features are MagicDNS (gives your devices memorable names like \"homeserver\" instead of IP addresses), subnet routers (expose your entire home LAN to your Tailscale network so you can access printers, cameras, and other non-Tailscale devices remotely), and exit nodes (route all your internet traffic through a specific device — instant VPN for public Wi-Fi security or accessing geo-restricted content). The free tier is generous: up to 100 devices and 3 users. Tailscale pairs perfectly with <a href=\"article.html?id=openclaw\">OpenClaw</a> for secure remote management of your AI agent.</p><p>The real-world impact is access to all your devices, all the time, with zero ongoing maintenance. Self-hosters report saving 5-10 hours of initial networking setup and eliminating recurring issues with dynamic IPs, expired certificates, and broken port forwarding rules. The security improvement is dramatic: instead of exposing services to the public internet, everything stays on a private encrypted network that's invisible to port scanners. At free-tier for personal use, the ROI is infinite — you're replacing hours of frustrating networking work with a 2-minute install. For the growing community of people self-hosting services (Home Assistant, Nextcloud, Plex, Jellyfin), Tailscale is the connective tissue that makes it all remotely accessible.</p><h3>⚡ Set it up in 5 minutes</h3><ol><li>Sign up at tailscale.com using your Google, Microsoft, or GitHub account</li><li>Install the Tailscale app on each device you want to connect (available on every OS including Linux, iOS, Android)</li><li>Log in on each device — they automatically join your private network</li><li>Access any device by its Tailscale IP (100.x.x.x) or MagicDNS name</li><li>Optional: enable a subnet router on your home server to access your entire LAN remotely</li></ol>",
  "tags": [
    "Networking",
    "Security"
  ],
  "section": "tech",
  "guides": [
    {
      "title": "Tailscale Setup Guide for Beginners",
      "type": "video",
      "source": "Learn Linux TV",
      "url": "https://www.youtube.com/watch?v=tW50igaFZTQ",
      "summary": "Step-by-step beginner guide to installing and using Tailscale across your devices."
    },
    {
      "title": "Quickstart Guide",
      "type": "article",
      "source": "Tailscale Docs",
      "url": "https://tailscale.com/kb/1017/install",
      "summary": "Official quickstart covering installation on every platform and first connection."
    },
    {
      "title": "Quick Overview",
      "type": "summary",
      "steps": [
        "Sign up at tailscale.com with Google, Microsoft, or GitHub",
        "Install the Tailscale app on each device",
        "Log in — devices automatically join your private network",
        "Access any device by its Tailscale IP or MagicDNS name"
      ]
    }
  ],
  "hub": "networking",
  "simplicityScore": {
    "score": 8.0,
    "timeSaved": 8,
    "easeOfSetup": 8
  },
  "frictionNote": "Free tier limited to 3 users. Some corporate firewalls block it. Requires account on all devices.",
  "dropId": null
}
