{
  "id": "wise-transfers",
  "title": "Wise — International Money Without the Bank Markup",
  "emoji": "💸",
  "summary": "Send money abroad at the real exchange rate. Hold 40+ currencies. Get local bank details in multiple countries.",
  "url": "https://wise.com/",
  "editorsNote": "Reddit's r/wise and r/digitalnomad frequently report that verification can be frustratingly slow (up to 2 weeks for some countries), and large transfers occasionally get flagged for additional compliance checks that delay them by days. Most users say once verified, the service is dramatically better and cheaper than any bank for international transfers.",
  "content": "<h3>How to stop losing hundreds of dollars on every international transfer</h3><p>You need to send $5,000 to a family member abroad, pay a freelancer in Europe, or convert savings into another currency. Your bank quotes you an exchange rate that looks close to Google's rate — but it's not. Banks mark up exchange rates by 3-5% on top of their stated transfer fees, hiding the real cost in the spread. On a $5,000 transfer, you could lose $150-250 without realizing it because the \"fee\" shown was only $25. This hidden markup is how banks make billions annually on international transfers, and most customers never notice because they don't compare the rate they received to the mid-market rate.</p><p>Wise (formerly TransferWise) uses the mid-market exchange rate — the real one you see on Google or Reuters — and charges a small, transparent fee upfront (typically 0.3-0.7% depending on the currency pair). For that same $5,000 transfer, Wise might charge $25-35 total, saving you $125-225 compared to a traditional bank. The multi-currency account holds 40+ currencies with local bank details in USD, EUR, GBP, AUD, SGD, and more. This means you can receive payments in those currencies like a local — a freelancer in the US can invoice European clients in EUR and receive it without conversion, then convert when the rate is favorable.</p><p>The standout features are the Wise debit card (spend in any currency at the mid-market rate — the best travel card for most people, beating traditional travel cards by 2-4%), auto-conversions (set a target exchange rate and Wise converts automatically when the market hits your number — like a limit order for currencies), and the transparent fee calculator that shows you exactly how much the recipient gets before you send. Compare that to banks where you find out the real cost only after the money arrives. For digital nomads and remote workers who also use <a href=\"article.html?id=tailscale\">Tailscale</a> to access their home banking from abroad, Wise eliminates the other half of the international money problem.</p><p>The real-world financial impact is significant: a freelancer receiving $3,000/month from international clients saves $720-1,440 per year switching from bank transfers to Wise. A family sending $1,000/month abroad saves $360-600 annually. Expats who use the debit card for daily spending in a foreign currency save 2-4% on every purchase — that's $60-120/month on $3,000 of spending. Beyond money, Wise saves time: transfers complete in hours instead of the 3-5 business days banks take, the app shows real-time tracking, and there's no branch visit required. Setup takes 10 minutes; the first transfer saves enough to justify it immediately.</p><h3>⚡ Set it up in 5 minutes</h3><ol><li>Sign up at wise.com with your email — no bank visit or paperwork needed</li><li>Verify your identity with a photo ID and selfie (usually approved within minutes, sometimes up to 48 hours)</li><li>Add your bank account or debit card as a funding source</li><li>Send your first transfer — enter the amount, see the fee and exchange rate upfront, and confirm</li><li>Order the Wise debit card for free to spend in any currency at the real exchange rate</li></ol>",
  "tags": [
    "Finance",
    "Travel"
  ],
  "hub": "financial-automation",
  "section": "tech",
  "featured": false,
  "simplicityScore": {
    "score": 8.4,
    "timeSaved": 8,
    "easeOfSetup": 9
  },
  "frictionNote": "Identity verification required (standard KYC). Some countries have limited features. Large transfers may take 1-2 business days.",
  "guides": [
    {
      "title": "How to Use Wise (TransferWise) — Full Tutorial",
      "type": "video",
      "source": "Saunders Says",
      "url": "https://www.youtube.com/watch?v=rjg5ELpWbhc",
      "summary": "Step-by-step walkthrough of setting up a Wise account, making your first transfer, and using the multi-currency card."
    },
    {
      "title": "Wise Help Centre — Getting Started",
      "type": "article",
      "source": "Wise",
      "url": "https://wise.com/help/articles/2932105/how-do-i-send-money",
      "summary": "Official guide to sending money internationally, including fees breakdown and delivery times."
    },
    {
      "title": "Quick Start",
      "type": "summary",
      "steps": [
        "Sign up at wise.com with your email",
        "Verify your identity with a photo ID and selfie",
        "Enter the amount and recipient's bank details",
        "Choose how to pay (bank transfer is cheapest)",
        "Track your transfer in real-time from the app"
      ]
    }
  ]
}