{
  "id": "away-carry-on",
  "title": "Away Carry-On — The Only Bag You Need for Short Trips",
  "emoji": "🧳",
  "summary": "A hardshell carry-on with a built-in compression system, ejectable battery, and a lifetime warranty.",
  "url": "https://www.awaytravel.com/suitcases/carry-on",
  "editorsNote": "Reddit's r/onebag and r/travel frequently complain that the Away Carry-On is heavier than competitors like the Travelpro Maxlite (7.6 lbs vs 5.4 lbs), and the wheels can crack on cobblestone streets. Most still recommend it for the compression system and warranty.",
  "content": "<h3>How to stop overpacking and stressing at the gate</h3><p>You know the routine: you're standing at the gate watching other passengers nervously eye-measuring their bags against the sizer, praying theirs fits. You've overpacked because your old bag has zero organization, so everything's crammed in like a fabric bomb. Then you check a bag \"just in case\" — adding $35 each way, 30 minutes at baggage claim, and the lottery of whether your stuff arrives intact. This cycle repeats every trip because the bag is the problem, not your packing skills.</p><p>The Away Carry-On is engineered to end this cycle. The polycarbonate hardshell flexes without cracking (unlike cheap ABS plastic), and the interior compression system — a zippered panel that presses your clothes flat — lets you fit 3-4 days of clothing in a bag that meets every major airline's carry-on requirements (22\" x 14\" x 9\"). Two separate compartments keep folded clothes on one side and toiletries/electronics/shoes on the other. Unlike soft bags that bulge unpredictably, the hardshell maintains its exact dimensions whether it's half-full or stuffed.</p><p>Three features set it apart for simplifying travel. First, the ejectable battery (on the Bigger Carry-On model) charges your phone via USB without opening the bag, and pops out in seconds for TSA compliance — no fumbling. Second, the 360° Hinomoto spinner wheels are genuinely silent on airport floors and roll smoothly in any direction. Third, the telescoping handle locks at multiple heights so it's comfortable whether you're 5'2\" or 6'4\". The lifetime warranty covers wheels, handles, zippers, and shells — the exact parts that fail on cheaper bags.</p><p>The math on value is straightforward: a $50 bag replaced every 2 years costs $250 over a decade, plus checked bag fees from overpacking. The Away at $275 with a lifetime warranty pays for itself within 4 trips if you avoid checking bags. Time saved: zero minutes at baggage claim, zero minutes reorganizing a disorganized bag, zero stress about whether it fits. For frequent travelers who also use tools like <a href=\"article.html?id=wise-transfers\">Wise</a> to save on foreign currency, the Away Carry-On completes the stress-free travel stack.</p><h3>⚡ Set it up in 5 minutes</h3><ol><li>Choose your size — the regular Carry-On (22\") fits overhead bins on all major airlines; the Bigger Carry-On suits international flights with more generous limits</li><li>If you got the battery model, charge it fully via USB-C before your first trip</li><li>Pack using the compression system: clothes on the zip side, everything else in the open compartment</li><li>Zip the compression panel down to flatten clothes and create space</li></ol>",
  "tags": [
    "Travel",
    "Gear"
  ],
  "hub": "travel-packing",
  "section": "products",
  "featured": false,
  "simplicityScore": {
    "score": 7.6,
    "timeSaved": 6,
    "easeOfSetup": 10
  },
  "frictionNote": "$275 is steep for a carry-on. The battery model adds weight. Limited color options compared to cheaper alternatives.",
  "guides": [
    {
      "title": "Away Carry-On Review — 2 Years Later",
      "type": "video",
      "source": "Pack Hacker",
      "url": "https://www.youtube.com/watch?v=2xgXqpCR_qM",
      "summary": "Honest long-term review covering durability, packing capacity, and the built-in battery after years of travel."
    },
    {
      "title": "Away Carry-On Product Page",
      "type": "article",
      "source": "Away",
      "url": "https://www.awaytravel.com/suitcases/carry-on",
      "summary": "Full specs, size guide, color options, and details on the ejectable battery system."
    },
    {
      "title": "Quick Start",
      "type": "summary",
      "steps": [
        "Unbox and remove protective wrapping",
        "Charge the ejectable battery via USB-C",
        "Use the compression pad to organize clothes",
        "Slide the battery into the side compartment",
        "TSA-approved lock defaults to 0-0-0 — set your own combo"
      ]
    }
  ]
}