{
  "id": "roborock-s8-maxv-ultra",
  "title": "Roborock S8 MaxV Ultra",
  "emoji": "🤖",
  "summary": "A robot vacuum and mop that empties itself, washes its own mop pads, and navigates with AI obstacle avoidance. Set it and truly forget it.",
  "content": "<p>The Roborock S8 MaxV Ultra is as close to a fully autonomous cleaning robot as you can get. It vacuums, mops, empties its dustbin, washes and dries its mop pads, and refills its water tank — all automatically. You genuinely just let it run and forget about it for weeks.</p><p>The AI-powered obstacle avoidance uses a camera and structured light to identify and dodge shoes, cables, pet waste, and other floor clutter. The LiDAR navigation creates precise maps of your home, letting you set no-go zones, room-specific cleaning schedules, and custom suction levels per area.</p><p>The dual rubber brushes handle everything from hardwood to carpet, and the VibraRise mopping system lifts the mop pad when it detects carpet. Integration with Home Assistant and Alexa means you can trigger cleaning from automations or voice commands. It's the single best quality-of-life upgrade for any home.</p>",
  "tags": [
    "Smart Home",
    "Products"
  ],
  "section": "products",
  "guides": [
    {
      "title": "Roborock S8 MaxV Ultra — 6 Months Later",
      "type": "video",
      "source": "6 Months Later",
      "url": "https://www.youtube.com/watch?v=cG1Lq3RIf6U",
      "summary": "Honest long-term review covering setup, daily use, and whether it's worth it."
    },
    {
      "title": "Roborock Support & Setup",
      "type": "article",
      "source": "Roborock",
      "url": "https://www.roborock.com/pages/support",
      "summary": "Official support page with setup guides, app instructions, and troubleshooting."
    },
    {
      "title": "Quick Overview",
      "type": "summary",
      "steps": [
        "Unbox and assemble the dock station",
        "Download the Roborock app and add the device",
        "Let it map your home on its first run",
        "Set room-specific schedules and no-go zones",
        "Optionally connect to Home Assistant or Alexa"
      ]
    }
  ]
}